In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [2]:
%%sql
use db_project

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [4]:
%%sql
CREATE TABLE Students1 (
    student_id   INT PRIMARY KEY,
    student_name VARCHAR(100)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [6]:
%%sql
CREATE TABLE StudentPhones (
    student_id INT,
    phone      VARCHAR(20),
    PRIMARY KEY (student_id, phone),
    FOREIGN KEY (student_id) REFERENCES Students1(student_id)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [7]:
%%sql
INSERT INTO Students1 (student_id, student_name)
VALUES (1, 'Alice'),
       (2, 'Bob');

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[]

In [8]:
%%sql
INSERT INTO StudentPhones (student_id, phone)
VALUES (1, '123-4567'),
       (1, '987-6543'),
       (2, '555-1212');

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[]

In [9]:
%%sql
select
s.student_name,
p.phone 
from Students1 s
join StudentPhones p on s.student_id=p.student_id

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('Alice', '123-4567'), ('Alice', '987-6543'), ('Bob', '555-1212')]

In [ ]:
2. Second Normal Form (2NF)
Definition & Purpose (2NF)
2NF requires the table to be in 1NF and that all non-key columns are fully functionally dependent on the entire primary key.
Purpose: To remove partial dependencies (where a column depends on only part of a composite key).

Before 
-- This table is in 1NF but not in 2NF because course details depend only on course_id.
CREATE TABLE Enrollment_Non2NF (
    student_id  INT,
    course_id   INT,
    course_name VARCHAR(100),
    instructor  VARCHAR(100),
    PRIMARY KEY (student_id, course_id)
);

-- Sample data insertion
INSERT INTO Enrollment_Non2NF (student_id, course_id, course_name, instructor)
VALUES (1, 101, 'Intro to SQL', 'Dr. Smith'),
       (2, 101, 'Intro to SQL', 'Dr. Smith'),
       (1, 102, 'Database Design', 'Dr. Jones');


After 

-- Table recording enrollments (relationship)
CREATE TABLE Enrollment (
    student_id INT,
    course_id  INT,
    PRIMARY KEY (student_id, course_id),
    FOREIGN KEY (course_id) REFERENCES Courses(course_id)
);

-- Table holding course details
CREATE TABLE Courses (
    course_id   INT PRIMARY KEY,
    course_name VARCHAR(100),
    instructor  VARCHAR(100)
);


-- Insert course details
INSERT INTO Courses (course_id, course_name, instructor)
VALUES (101, 'Intro to SQL', 'Dr. Smith'),
       (102, 'Database Design', 'Dr. Jones');

-- Insert enrollment data
INSERT INTO Enrollment (student_id, course_id)
VALUES (1, 101),
       (2, 101),
       (1, 102);


3. Third Normal Form (3NF)
Definition & Purpose (3NF)
3NF requires that the table is in 2NF and that all the columns are directly dependent on the primary key 
(i.e., no transitive dependencies).
Purpose: To remove transitive dependencies where a non-key column depends on another non-key column.

Before

-- This table is in 2NF but has a transitive dependency:
CREATE TABLE Courses_Non3NF (
    course_id        INT PRIMARY KEY,
    course_name      VARCHAR(100),
    instructor       VARCHAR(100),
    instructor_office VARCHAR(100)
);

-- Sample data insertion
INSERT INTO Courses_Non3NF (course_id, course_name, instructor, instructor_office)
VALUES (101, 'Intro to SQL', 'Dr. Smith', 'Room 101'),
       (102, 'Database Design', 'Dr. Jones', 'Room 102');

After 

-- Revised Courses table (now 3NF): holds course-specific data
CREATE TABLE Courses (
    course_id   INT PRIMARY KEY,
    course_name VARCHAR(100),
    instructor  VARCHAR(100),
    FOREIGN KEY (instructor) REFERENCES Instructors(instructor)
);

-- New table for instructor details
CREATE TABLE Instructors (
    instructor       VARCHAR(100) PRIMARY KEY,
    instructor_office VARCHAR(100)
);

-- Insert instructor details
INSERT INTO Instructors (instructor, instructor_office)
VALUES ('Dr. Smith', 'Room 101'),
       ('Dr. Jones', 'Room 102');

-- Insert courses with reference to instructors
INSERT INTO Courses (course_id, course_name, instructor)
VALUES (101, 'Intro to SQL', 'Dr. Smith'),
       (102, 'Database Design', 'Dr. Jones');